Revit 2027 API
PointCloudInstance.HasColor Method
 Returns true if at least one scan of the element have color, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasColor()
Public Function HasColor As Boolean
public:
bool HasColor()
member HasColor : unit -> bool
Return Value
Boolean
 True if at least one scan of the element have color, false otherwise.
See Also
Reference
PointCloudInstance Class
Autodesk.Revit.DB Namespace